src/cf/src/Documents/НалоговаяНакладная/НалоговаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НалоговаяНакладная</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателямиНалоговый</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИнвойса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаТовара</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОтгрузкаТовара</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаТовара</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОтгрузкаТовара</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДополнительныеРасходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаТовара</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОтгрузкаТовара</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСпособыОплаты</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДенежныхСредств</name>
      <type>
        <types>CatalogRef.TypesDePayment</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Чек</name>
      <type>
        <types>CatalogRef.БанковскиеЧеки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/НалоговаяНакладная/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем ЗакрытиеФормы;

#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма); 
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	Если Объект.Ссылка.Пустая() Тогда 
		УстановитьВидЦеныПоДоговору();
	иначе
		Если Объект.ВидЦен.Пустая() Тогда 
			УстановитьВидЦеныПоДоговору();
		Иначе
			ВидЦены = Объект.ВидЦен;
			РаботаСДокументамиКлиентСервер.ЗаполнитьСписокВыбораВидовЦен(ВидЦены, Элементы.ТЧТоварыВидЦены);
		КонецЕсли;
	КонецЕсли;
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
	ЗаполнитьОстаткиНаСервере();
	Если Объект.РучнаяКорректировка Тогда 
		СпособОплатыНаФорме = Объект.СпособОплаты;
	Иначе
		СпособОплатыНаФорме = РаботаСДокументами.ПолучитьСпособОплаты(Объект);
	КонецЕсли;
	НастроитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОперацииСПодключаемымОборудованиемКлиент.ПодключитьОборудование(УникальныйИдентификатор, Истина); 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = РаботаСДокументамиКлиент.КлиентуЗапрещеноОтгружать(Объект);
	Если Отказ Тогда Возврат; КонецЕсли;
	Отказ = Не СерииИРазмещениеКлиент.ПроверитьСоответствиеСерийТоварам(ЭтаФорма, Объект.ТЧТовары, Объект.ТЧСерии, ПараметрыЗаписи);
	РаботаСДокументамиКлиент.ПроверитьСуммуАвансовТоварногоДокумента(Объект, Отказ);
	Объект.ВидЦен = ВидЦены;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
	Если ТекущийОбъект.РучнаяКорректировка Тогда 
		ТекущийОбъект.СпособОплаты = СпособОплатыНаФорме;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
	ЗаполнитьОстаткиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены, Элементы.ТЧТоварыВидЦены);	
	//УстановитьЦеныНаСервере();
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	Объект.Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Объект.Контрагент, Объект.Организация, Истина);
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЦены(Команда)
	УстановитьЦеныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЦеныПоЗаказу(Команда)
	ПерезаполнитьЦеныПоЗаказуНаСервере();
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, False);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УказатьСерии(Команда)
	СерииИРазмещениеКлиент.УказатьСерии(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьСерии(Команда)
	ЗаполнитьСерииНаСервере();
КонецПроцедуры  

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	ЗаполнитьОстаткиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансыПоСуммеДокумента(Команда)
	ЗаполнитьПоОстаткамНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансыВсеНезакрытые(Команда)
	ЗаполнитьПоОстаткамНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТЧЗачётАвансовОснованиеПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧЗачётАвансов.ТекущиеДанные;
	ДанныеСуммы = РаботаСДокументамиВызовСервера.ПолучитьСуммуОснованияДляПлатёжногоДокумента(ТекСтр.Основание);
	ЗаполнитьЗначенияСвойств(ТекСтр, ДанныеСуммы);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
		ТекСтр.ВидЦены = ВидЦены;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	РаботаСДокументамиКлиент.ПроверитьКратностьЕдиницы(Элемент.ТекущиеДанные, Объект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередУдалением(Элемент, Отказ)
	Для Каждого Инд Из Элементы.ТЧТовары.ВыделенныеСтроки Цикл
		Стр = Объект.ТЧТовары.НайтиПоИдентификатору(Инд);
		РаботаСДокументамиКлиентСервер.УдалитьСвязанныеСтроки(Объект, "ТЧСерии", Стр.КодСтроки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриАктивизацииЯчейки(Элемент)
	ТекСтр = Элемент.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат КонецЕсли;
	Если Элемент.ТекущийЭлемент = Элементы.ТЧТоварыКоличество Тогда
		Элемент.ТекущийЭлемент.ТолькоПросмотр = Не ЗначениеЗаполнено(ТекСтр.Упаковка);	
	КонецЕсли; 
	Если Элемент.ТекущийЭлемент = Элементы.ТЧТоварыЦена Или Элемент.ТекущийЭлемент = Элементы.ТЧТоварыСумма Тогда
		//Элемент.ТекущийЭлемент.ТолькоПросмотр = ЗначениеЗаполнено(ТекСтр.ВидЦены);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура ТЧТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыАвтоподбора = РаботаСДокументамиКлиент.ПараметрыАвтободбораНоменклатуры();
	ПараметрыАвтоподбора.ВидЦены = ВидЦены;
	ПараметрыАвтоподбора.ИсключитьХарактеристикиДляВнутреннегоИспользования = Истина;
	ПараметрыПолученияДанных.Вставить("ВыводитьСерию",Истина);
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка, ПараметрыАвтоподбора);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, ВыбранноеЗначение, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыХарактеристикаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	ДанныеОтбора = Новый Структура("МестоХранения, Номенклатура, Характеристика, Клиент", Объект.МестоХранения, ТекСтр.Номенклатура, ТекСтр.Характеристика, Объект.Контрагент); 
	СерииИРазмещениеКлиент.ВыбратьСериюПоОстаткам(РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект), ДанныеОтбора,, ТекСтр);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина, "Количество");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыВидЦеныПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьЦенуНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПроцентСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиКоличествоПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Истина, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Истина, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Истина, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены, Элементы.ТЧТоварыВидЦены);	
	//УстановитьЦеныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОтгрузкам(Команда)
	ЗаполнитьПоОтгрузкамНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзExcel(Команда)
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыЗагрузки",ЭтаФорма);
	Пар = Новый Структура("СоздаватьТовары",Ложь);
	ОткрытьФорму("Обработка.ЗагрузкаИзExcel.Форма.Форма",Пар,ЭтотОбъект,ЭтотОбъект.УникальныйИдентификатор,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоРеализациям(Команда)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыОтбора.Вставить("Проведен", Истина);
	ПараметрыОтбора.Вставить("Фискализован", Ложь);
	
	Пар = Новый Структура;
	Пар.Вставить("МножественныйВыбор",Истина);
	Пар.Вставить("Отбор", ПараметрыОтбора);
	Оп = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Подбор");
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаВыбора",Пар,ЭтаФорма,ЭтаФорма.УникальныйИдентификатор,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаПриИзменении(Элемент)
	РучнаяКорректировкаПриИзмененииНаСервере();
	НастроитьФорму();
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияФормыРедактированияДовоза(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	Если РезультатЗакрытия.Идентификатор = Неопределено Тогда
		Стр = Объект.ТЧТовары.Добавить();
		Стр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
	Иначе
		Стр = Объект.ТЧТовары.НайтиПоИдентификатору(РезультатЗакрытия.Идентификатор);
		РаботаСДокументамиКлиентСервер.УдалитьСвязанныеСтроки(Объект, "ТЧСерии", Стр.КодСтроки);
	КонецЕсли;	
	ЗаполнитьЗначенияСвойств(Стр, РезультатЗакрытия,, "КодСтроки");
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Истина);
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" и ВводДоступен() Тогда 
		Штрихкод = ОперацииСПодключаемымОборудованиемКлиент.ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник);
		РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоШтрихкоду(Штрихкод,Объект,,,ВидЦены,ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыЗагрузки(Результат,ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	ЗаполнитьИзExcelНаСервере(Результат);
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт
    Если Значение = Неопределено Тогда
        Возврат;
    КонецЕсли;
     
    МассивДокументов = Значение; 
	ЗаполнитьПоДокументамНаСервере(МассивДокументов);
	ЗаполнитьОстаткиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Дополнительно  

&НаСервере
Процедура УстановитьЦеныНаСервере()
	РаботаСДокументами.УстановитьЦеныВТабличнойЧасти(Объект.ТЧТовары, ВидЦены, Объект.Дата);	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьЦеныПоЗаказуНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Основание) Тогда Возврат КонецЕсли;
	ТЗЗаказ = Объект.Основание.ТЧТовары.Выгрузить();
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		СтрЗаказ = ТЗЗаказ.Найти(Стр.КодСтроки, "КодСтроки");
		Если СтрЗаказ = Неопределено Тогда
			Стр.ВидЦены = Неопределено;
			Стр.Цена = 0;
			Стр.ЦенаSKU = 0;
		Иначе	
			Стр.ВидЦены = СтрЗаказ.ВидЦены;
			Стр.Цена = СтрЗаказ.Цена;
			Стр.ЦенаSKU = СтрЗаказ.ЦенаSKU;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСерииНаСервере()
	СерииИРазмещение.ЗаполнитьСерииПоОстаткам(Объект,Объект.Контрагент);	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере(ВсеНеоплаченные)
	РаботаСДокументами.ПолучитьАвансыДляЗакрытия(Объект, Истина, ВсеНеоплаченные);		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидЦеныПоДоговору()
	//ВидЦены = ?(ЗначениеЗаполнено(Объект.Договор.ВидЦены),Объект.Договор.ВидЦены, Справочники.ВидыЦен.Розничная);
	ВидЦены = ?(ЗначениеЗаполнено(Объект.Контрагент.ТипЦены),Объект.Контрагент.ТипЦены, Справочники.ВидыЦен.Розничная);
	РаботаСДокументамиКлиентСервер.ЗаполнитьСписокВыбораВидовЦен(ВидЦены, Элементы.ТЧТоварыВидЦены);
КонецПроцедуры

&НаКлиенте
Процедура ТЧДополнительныеРасходыСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧДополнительныеРасходы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧДополнительныеРасходыСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧДополнительныеРасходы.ТекущиеДанные);
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	Элементы.СпособОплаты.Доступность = Объект.РучнаяКорректировка;
	Элементы.СтраницаСпособыОплаты.Доступность = Объект.РучнаяКорректировка;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОтгрузкамНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтгрузкаТовараТЧТовары.Ссылка КАК ОтгрузкаТовара,
	|	ОтгрузкаТовараТЧТовары.Номенклатура КАК Номенклатура,
	|	ОтгрузкаТовараТЧТовары.Характеристика КАК Характеристика,
	|	ОтгрузкаТовараТЧТовары.Упаковка КАК Упаковка,
	|	ОтгрузкаТовараТЧТовары.Серия КАК Серия,
	|	ОтгрузкаТовараТЧТовары.УказаноНесколькоСерий КАК УказаноНесколькоСерий,
	|	ОтгрузкаТовараТЧТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ОтгрузкиТоваровОстатки.КоличествоОстаток КАК Количество,
	|	ОтгрузкаТовараТЧТовары.ВидЦены КАК ВидЦены,
	|	ОтгрузкаТовараТЧТовары.ЦенаSKU КАК ЦенаSKU,
	|	ОтгрузкаТовараТЧТовары.Цена КАК Цена,
	|	ОтгрузкаТовараТЧТовары.Сумма КАК Сумма,
	|	ОтгрузкаТовараТЧТовары.ПроцентСкидки КАК ПроцентСкидки,
	|	ОтгрузкаТовараТЧТовары.СуммаСкидки КАК СуммаСкидки,
	|	ОтгрузкаТовараТЧТовары.СуммаСНДС КАК СуммаСНДС,
	|	ОтгрузкаТовараТЧТовары.СтавкаНДС КАК СтавкаНДС,
	|	ОтгрузкаТовараТЧТовары.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	РегистрНакопления.ОтгрузкиТоваров.Остатки(
	|			,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент) КАК ОтгрузкиТоваровОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтгрузкаТовара.ТЧТовары КАК ОтгрузкаТовараТЧТовары
	|		ПО ОтгрузкиТоваровОстатки.ДокументОтгрузки = ОтгрузкаТовараТЧТовары.Ссылка
	|			И ОтгрузкиТоваровОстатки.Номенклатура = ОтгрузкаТовараТЧТовары.Номенклатура
	|ГДЕ
	|	НЕ ОтгрузкиТоваровОстатки.КоличествоОстаток = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтгрузкаТовараТЧУслуги.Ссылка КАК ОтгрузкаТовара,
	|	ОтгрузкаТовараТЧУслуги.Номенклатура КАК Номенклатура,
	|	ОтгрузкиТоваровОстатки.КоличествоОстаток КАК Количество,
	|	ОтгрузкаТовараТЧУслуги.Цена КАК Цена,
	|	ОтгрузкаТовараТЧУслуги.Сумма КАК Сумма,
	|	ОтгрузкаТовараТЧУслуги.СуммаСНДС КАК СуммаСНДС,
	|	ОтгрузкаТовараТЧУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ОтгрузкаТовараТЧУслуги.СуммаНДС КАК СуммаНДС,
	|	ОтгрузкаТовараТЧУслуги.Содержание КАК Содержание
	|ИЗ
	|	РегистрНакопления.ОтгрузкиТоваров.Остатки(
	|			,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент) КАК ОтгрузкиТоваровОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтгрузкаТовара.ТЧУслуги КАК ОтгрузкаТовараТЧУслуги
	|		ПО ОтгрузкиТоваровОстатки.ДокументОтгрузки = ОтгрузкаТовараТЧУслуги.Ссылка
	|			И ОтгрузкиТоваровОстатки.Номенклатура = ОтгрузкаТовараТЧУслуги.Номенклатура
	|ГДЕ
	|	НЕ ОтгрузкиТоваровОстатки.КоличествоОстаток = 0";
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	П = Запрос.ВыполнитьПакет();
	Объект.ТЧТовары.Загрузить(П.Получить(0).Выгрузить());
	Объект.ТЧУслуги.Загрузить(П.Получить(1).Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзExcelНаСервере(Мас)
	Объект.ТЧТовары.Очистить();
	Для Каждого Эл из Мас Цикл
		НС = Объект.ТЧТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Эл);
		НС.СтавкаНДС = НС.Номенклатура.СтавкаНДС;
		Если ЗначениеЗаполнено(НС.Номенклатура) Тогда 
			НС.Упаковка = НС.Номенклатура.Единица;
		КонецЕсли;
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(НС);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументамНаСервере(МассивДокументов)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугТЧТовары.Ссылка КАК ОтгрузкаТовара,
	|	РеализацияТоваровУслугТЧТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТЧТовары.Характеристика КАК Характеристика,
	|	РеализацияТоваровУслугТЧТовары.Упаковка КАК Упаковка,
	|	РеализацияТоваровУслугТЧТовары.Серия КАК Серия,
	|	РеализацияТоваровУслугТЧТовары.УказаноНесколькоСерий КАК УказаноНесколькоСерий,
	|	РеализацияТоваровУслугТЧТовары.КоличествоУпаковок - ЕСТЬNULL(ВозвратОтПокупателяТЧТовары.КоличествоУпаковок, 0) КАК КоличествоУпаковок,
	|	РеализацияТоваровУслугТЧТовары.Количество - ЕСТЬNULL(ВозвратОтПокупателяТЧТовары.Количество, 0) КАК Количество,
	|	РеализацияТоваровУслугТЧТовары.ВидЦены КАК ВидЦены,
	|	РеализацияТоваровУслугТЧТовары.ЦенаSKU КАК ЦенаSKU,
	|	РеализацияТоваровУслугТЧТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТЧТовары.Сумма - ЕСТЬNULL(ВозвратОтПокупателяТЧТовары.Количество, 0) КАК Сумма,
	|	РеализацияТоваровУслугТЧТовары.ПроцентСкидки КАК ПроцентСкидки,
	|	РеализацияТоваровУслугТЧТовары.СуммаСкидки КАК СуммаСкидки,
	|	РеализацияТоваровУслугТЧТовары.СуммаСНДС - ЕСТЬNULL(ВозвратОтПокупателяТЧТовары.СуммаСНДС, 0) КАК СуммаСНДС,
	|	РеализацияТоваровУслугТЧТовары.СтавкаНДС КАК СтавкаНДС,
	|	РеализацияТоваровУслугТЧТовары.СуммаНДС - ЕСТЬNULL(ВозвратОтПокупателяТЧТовары.СуммаНДС, 0) КАК СуммаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ТЧТовары КАК РеализацияТоваровУслугТЧТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратОтПокупателя.ТЧТовары КАК ВозвратОтПокупателяТЧТовары
	|		ПО РеализацияТоваровУслугТЧТовары.Ссылка = ВозвратОтПокупателяТЧТовары.Ссылка.Основание
	|			И РеализацияТоваровУслугТЧТовары.Номенклатура = ВозвратОтПокупателяТЧТовары.Номенклатура
	|			И РеализацияТоваровУслугТЧТовары.КодСтроки = ВозвратОтПокупателяТЧТовары.КодСтроки
	|ГДЕ
	|	РеализацияТоваровУслугТЧТовары.Ссылка В(&МассивДокументов)
	|	И НЕ РеализацияТоваровУслугТЧТовары.Количество - ЕСТЬNULL(ВозвратОтПокупателяТЧТовары.Количество, 0) = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТЧУслуги.Ссылка КАК ОтгрузкаТовара,
	|	РеализацияТоваровУслугТЧУслуги.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТЧУслуги.Количество КАК Количество,
	|	РеализацияТоваровУслугТЧУслуги.Цена КАК Цена,
	|	РеализацияТоваровУслугТЧУслуги.Сумма КАК Сумма,
	|	РеализацияТоваровУслугТЧУслуги.СуммаСНДС КАК СуммаСНДС,
	|	РеализацияТоваровУслугТЧУслуги.СтавкаНДС КАК СтавкаНДС,
	|	РеализацияТоваровУслугТЧУслуги.СуммаНДС КАК СуммаНДС,
	|	РеализацияТоваровУслугТЧУслуги.Содержание КАК Содержание
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ТЧУслуги КАК РеализацияТоваровУслугТЧУслуги
	|ГДЕ
	|	РеализацияТоваровУслугТЧУслуги.Ссылка В(&МассивДокументов)";
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	П = Запрос.ВыполнитьПакет();
	Объект.ТЧТовары.Загрузить(П.Получить(0).Выгрузить());
	Объект.ТЧУслуги.Загрузить(П.Получить(1).Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткиНаСервере()
	МасПоиска = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВНаличииОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВНаличииОстатки.Характеристика КАК Характеристика,
	|	ТоварыВНаличииОстатки.Серия КАК Серия,
	|	ТоварыВНаличииОстатки.КоличествоОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.ТоварыВНаличии.Остатки(
	|			,
	|			МестоХранения = &МестоХранения
	|				И (Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						ВТ.Номенклатура,
	|						ВТ.Характеристика
	|					ИЗ
	|						ВТ КАК ВТ)) КАК ТоварыВНаличииОстатки";
	Запрос.УстановитьПараметр("ВТ",Объект.ТЧТовары.Выгрузить());
	Запрос.УстановитьПараметр("МестоХранения",Объект.МестоХранения);
	ТЗОстатки = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр из Объект.ТЧТовары Цикл 
		МасОстаток = ТЗОстатки.НайтиСтроки(Новый Структура("Номенклатура,Характеристика",Стр.Номенклатура,Стр.Характеристика));
		Если МасОстаток.Количество() = 0 Тогда 
			Стр.Остаток = 0;
			Продолжить;
		КонецЕсли;
		СтрОстаток = МасОстаток.Получить(0);
		Стр.Остаток = СтрОстаток.Остаток;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура РучнаяКорректировкаПриИзмененииНаСервере()
	Если Не Объект.РучнаяКорректировка Тогда 
		СпособОплатыНаФорме = РаботаСДокументами.ПолучитьСпособОплаты(Объект);
	КонецЕсли;
	НастроитьФорму();
КонецПроцедуры

#КонецОбласти
